src/CF/Catalogs/Клиенты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Catalog>
		<Properties>
			<Name>Клиенты</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<BasedOn>
				<xr:Item>Catalog.Поставщики</xr:Item>
				<xr:Item>Catalog.Сотрудники</xr:Item>
			</BasedOn>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПравовойСтатус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПравовойСтатус</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЦен</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРождения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяПолучателя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1020</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1020</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МФО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеБанка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеДляПечати</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1020</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Адрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1020</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСвидетельстваПлательщикаНалогаНаДобавочнуюСтоимость</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОКПО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнаяВалюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойШтрихКод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>129</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПочтовыйИндекс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерКарты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентСкидки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Регион</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Регионы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Телефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1020</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормулаТекстаЭтикетки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФормулыОписания</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеДенег</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХранилищаДенег</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭлектроннаяПочта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоСотрудник</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КорреспондентскийСчет</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>24</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособДоставки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СпособыДоставки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокОплатыВДняхПоУмолчанию</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокОтчетаКомиссионераПоОтдельномуДокументуПередачиТоваров</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентКомиссионногоВознаграждения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/CF/Catalogs/Клиенты/Ext/ObjectModule.bsl
//sza140411-1653 : 
//sza130915-1735 : 

Процедура ПередЗаписью(Отказ)
	
	Если НЕ Отказ 
		И Не ПометкаУдаления Тогда
		
		Модифицированность = Модифицированность();
		
		Если не ЭтоГруппа 
			и Модифицированность ТОгда
			
			Если НЕ ЗначениеЗаполнено(НаименованиеДляПечати) Тогда
				НаименованиеДляПечати = Наименование;	
			КонецЕсли;
			Если ЗначениеЗаполнено(Родитель) тогда 
				если ЗначениеЗаполнено(Родитель.ВидЦен) тогда
					
					ВидЦен = Родитель.ВидЦен;	
				КонецЕсли;
				если ОбщийМодульПовтор.ПолучитьПараметрСеанса("ИспользоватьСкидкиПС")
					и не родитель.ПроцентСкидки = 0 тогда
					
					ПроцентСкидки = родитель.ПроцентСкидки;
				КонецЕсли;	
			КонецЕсли;
			
			Если не ЗначениеЗаполнено(ПравовойСтатус) Тогда
				ПравовойСтатус = ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("ПравовойСтатусПоУмолчанию");
			КонецЕсли;
			
			Отказ = ОбщийМодульСервер.ПроверитьУникальностьОКПО(Отказ, "Клиенты", ЭтотОбъект.ОКПО, ЭтотОбъект.Ссылка);
			
			Отказ = ОбщийМодульСервер.ПроверитьУникальностьНаименование(Отказ, "Клиенты", ЭтотОбъект.Наименование, ЭтотОбъект.Ссылка);
			
		Иначеесли Модифицированность  тогда
			
			Если НЕ отказ Тогда
				ПроцентСкидкиУстановлен = ОбщийМодульПовтор.ПолучитьПараметрСеанса("ИспользоватьСкидкиПС") и не ПроцентСкидки = 0;
				
				ЗначениеЗаполненовидцен = ЗначениеЗаполнено(видцен);
				
				Если ЗначениеЗаполнено(Ссылка)
					И (ЗначениеЗаполненоВидЦен
					или ПроцентСкидкиУстановлен) Тогда
					
					Запрос = Новый Запрос;
					Запрос.Текст = "ВЫБРАТЬ Клиенты.Ссылка
					|ИЗ Справочник.Клиенты КАК Клиенты
					|ГДЕ Клиенты.Родитель = &Родитель
					|	И (Клиенты.ВидЦен <> &ВидЦен
					|			ИЛИ &ПроцентСкидкиУстановлен
					|				И Клиенты.ПроцентСкидки <> &ПроцентСкидки)
					|	И Клиенты.ЭтоГруппа = ЛОЖЬ";
					
					Запрос.УстановитьПараметр("Родитель", Ссылка);
					Запрос.УстановитьПараметр("ВидЦен", ВидЦен);  			
					Запрос.УстановитьПараметр("ПроцентСкидки", ПроцентСкидки);	
					
					Запрос.УстановитьПараметр("ПроцентСкидкиУстановлен", ПроцентСкидкиУстановлен);	
					
					РезультатЗапроса = Запрос.Выполнить();
					если не РезультатЗапроса.Пустой() Тогда
						ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
						Счетчик  = 0;
						
						Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
							КлиентОбъект = ВыборкаДетальныеЗаписи.ссылка.ПолучитьОбъект();
							Если ЗначениеЗаполненовидцен Тогда
								КлиентОбъект.ВидЦен = ВидЦен;
							КонецЕсли;
							
							если ПроцентСкидкиУстановлен тогда
								КлиентОбъект.ПроцентСкидки = ПроцентСкидки;	
							КонецЕсли;
							КлиентОбъект.Записать();
							Счетчик  = Счетчик  + 1;
						КонецЦикла;
						
						Если не Счетчик =0 Тогда
							
							если ОбщийМодульПовторВТеченииСервера.ВыводитьСообщенияМожно() тогда
								
								//Сообщение = Новый СообщениеПользователю;
								если ЗначениеЗаполнено(ВидЦен) тогда
									Если ПроцентСкидкиУстановлен Тогда
										текст = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Вид цен и Процент скидки назначены для ");
									иначе
										текст = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Вид цен назначен для ");
									КонецЕсли;				
								иначе
									текст = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Процент скидки назначен для ");
								КонецЕсли;
								//Сообщение.Текст = текст + Счетчик + ОбщийМодульПовтор.ПолучитьТекстНаЯзыке(" Клиентов этой группы.");
								ОбщийМодульСервисСервер.ДобавитьСообщениеПользователю(текст + Счетчик + " " + ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Клиентов этой группы."), , Ссылка);
								//Сообщение.Сообщить();	
							КонецЕсли;
							
						КонецЕсли; 	
					КонецЕсли;
				КонецЕсли;	
			КонецЕсли;
			
		КонецЕсли;
		
		ОбщийМодульСервер.ПроверитьСменуНаименованияНаТекущемЯзыке(Наименование, Ссылка, , Отказ);
		ОбщийМодульСервер.ПроверитьСменуНаименованияНаТекущемЯзыке(НаименованиеДляПечати, Ссылка, "НаименованиеДляПечати", Отказ);				
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	Комментарий = "";
	НаименованиеДляПечати = "";
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	//{{__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.Поставщики") Тогда
		// Заполнение шапки
		Адрес = ДанныеЗаполнения.Адрес;
		ВидЦен = ДанныеЗаполнения.ВидЦен;
		Комментарий = ДанныеЗаполнения.Комментарий;
		МФО = ДанныеЗаполнения.МФО;
		Наименование = ДанныеЗаполнения.Наименование;
		НаименованиеБанка = ДанныеЗаполнения.НаименованиеБанка;
		НаименованиеДляПечати = ДанныеЗаполнения.НаименованиеДляПечати;
		НомерСчета = ДанныеЗаполнения.НомерСчета;
		ОКПО = ДанныеЗаполнения.ОКПО;
		ОсновнаяВалюта = ДанныеЗаполнения.ОсновнаяВалюта;
		ПравовойСтатус = ДанныеЗаполнения.ПравовойСтатус;
		Регион = ДанныеЗаполнения.Регион;
		Склад = ДанныеЗаполнения.Склад;
		Телефон = ДанныеЗаполнения.Телефон;
		ХранилищеДенег = ДанныеЗаполнения.ХранилищеДенег;
		ЭлектроннаяПочта = ДанныеЗаполнения.ЭлектроннаяПочта;
		ЭтоСотрудник = ДанныеЗаполнения.ЭтоСотрудник;
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.Сотрудники") Тогда
		// Заполнение шапки
		Адрес = ДанныеЗаполнения.Адрес;
		ДатаРождения = ДанныеЗаполнения.ДатаРождения;
		Комментарий = ДанныеЗаполнения.Комментарий;
		Наименование = ДанныеЗаполнения.Наименование;
		ОКПО = ДанныеЗаполнения.ОКПО;
		Телефон = ДанныеЗаполнения.Телефон;
		ХранилищеДенег = ДанныеЗаполнения.ХранилищеДенег;
		ЭлектроннаяПочта = ДанныеЗаполнения.ЭлектроннаяПочта;
		ЭтоСотрудник = ИСТИНА;
		ВидЦен = ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("ВидЦенДляОтпускаТоваровСобственнымСотрудникам");
	КонецЕсли;
	//}}__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
КонецПроцедуры
